In [11]:
# 데이터 프레임 생성 p223
import pandas as pd 


bio_data = {'성명':['이겨레','조약돌'], 
            '나이':[25,19],
            '성별':['남','여'],
            '키':[185,163],
            '체중':[89,56]
            }
df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  56

In [12]:
#행 기준 선택 : loc, iloc
# 조약돌 행만 출력되도록 
df.iloc[0]

성명    이겨레
나이     25
성별      남
키     185
체중     89
Name: 0, dtype: object

In [13]:
df.set_index("성명", inplace=True)
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  56

In [14]:
# 체중만 출력
df["체중"]

성명
이겨레    89
조약돌    56
Name: 체중, dtype: int64

In [15]:
# 이겨레의 키 가져오기 loc[행이름], loc[행이름, 열이름]
df.loc["이겨레","키"]

185

In [16]:
 df.iloc[0,2] # 행, 열 iloc[위치값:숫자], iloc[행위치값:숫자, 열위치값:숫자]

185

In [17]:
# 내 이름과 정보로 행을 추가하세요 
df.loc["문도연"] = [23,'남',175,70]
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  56
문도연  23  남  175  70

In [18]:
# df.iloc[3] = [18,'남',180,90] 행추가는 loc만 가능
# df

In [19]:
df.loc["조약돌":"문도연"]

     나이 성별    키  체중
성명
조약돌  19  여  163  56
문도연  23  남  175  70

In [20]:
df.iloc[1:3] # 숫자 ~까지(마지막줄 포함x), 없으면 끝까지

     나이 성별    키  체중
성명
조약돌  19  여  163  56
문도연  23  남  175  70

In [21]:
df.iloc[:2] # 범위에서 생략은 끝! 처음부터 2-1(마지막포함x:-1)까지

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  56

In [22]:
print(">>>방법1: 1행 2열의 이름 지정")
df.loc["이겨레",['키','체중']]

>>>방법1: 1행 2열의 이름 지정

키     185
체중     89
Name: 이겨레, dtype: object

In [23]:
print(">>>방법2: 1행 2열의 좌표지정")
df.iloc[0,[2,3]] #2키,3체중

>>>방법2: 1행 2열의 좌표지정

키     185
체중     89
Name: 이겨레, dtype: object

In [24]:
print(">>>방법3: 1행 2열 이름으로 범위지정")
df.loc["이겨레",'키':'체중']

>>>방법3: 1행 2열 이름으로 범위지정

키     185
체중     89
Name: 이겨레, dtype: object

In [25]:
print(">>>방법4: 1행 2열 좌표로 범위지정")
df.iloc[0,2 : 3+1] # 2:키, 3:체중

>>>방법4: 1행 2열 좦로 범위지정

키     185
체중     89
Name: 이겨레, dtype: object

In [26]:
#p228 행 범위, 열 범위
print(">>>방법1: 2행 2열 이름으로 여러개 지정")
df.loc[["이겨레","조약돌"],['키','체중']]

>>>방법1: 2행 2열 이름으로 범위지정

       키  체중
성명
이겨레  185  89
조약돌  163  56

In [29]:
#p228 행 범위, 열 범위
print(">>>방법2: 2행 2열 이름으로 여러개 지정")
df.loc["이겨레":"조약돌",'키':'체중']

>>>방법2: 2행 2열 이름으로 여러개 지정

       키  체중
성명
이겨레  185  89
조약돌  163  56

In [30]:
print(">>>방법3: 2행 2열 좌표로 여러개 지정")
df.iloc[[0,1],[2,3]]

>>>방법3: 2행 2열 좌표로 여러개 지정

       키  체중
성명
이겨레  185  89
조약돌  163  56

In [32]:
print(">>>방법4: 2행 2열 좌표로 범위 지정")
df.iloc[0:1+1,2:3+1]

>>>방법4: 2행 2열 좌표로 범위 지정

       키  체중
성명
이겨레  185  89
조약돌  163  56

In [33]:
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  56
문도연  23  남  175  70

In [35]:
# 조약돌을 나이부터 키까지 출력
df.loc["조약돌",'나이':'키']

나이     19
성별      여
키     163
Name: 조약돌, dtype: object

In [36]:
df.loc["조약돌",["나이","성별","키"]]

나이     19
성별      여
키     163
Name: 조약돌, dtype: object

In [37]:
df.iloc[1,[0,1,2]]

나이     19
성별      여
키     163
Name: 조약돌, dtype: object

In [43]:
df.iloc[1,0:2+1]

나이     19
성별      여
키     163
Name: 조약돌, dtype: object

In [39]:
df.iloc[1, :2+1]

나이     19
성별      여
키     163
Name: 조약돌, dtype: object

In [40]:
# 원소값 변경 p232
print("원소값 변경 p232 -----")
df["BMI"] = 0
df

원소값 변경 p232 -----

     나이 성별    키  체중  BMI
성명
이겨레  25  남  185  89    0
조약돌  19  여  163  56    0
문도연  23  남  175  70    0

In [44]:
# 이겨레의 BMI는 26.00 수정
df.loc["이겨레","BMI"] = 26.0
df

     나이 성별    키  체중  BMI
성명
이겨레  25  남  185  89   26
조약돌  19  여  163  56    0
문도연  23  남  175  70    0

In [55]:
# 조약돌의 BMI 19.95로 수정(좌표값 이용)
df.iloc[1,4] = 19.95
df

     나이 성별    키  체중    BMI
성명
이겨레  25  남  185  89  26.00
조약돌  19  여  163  56  19.95
문도연  23  남  175  70   0.00

In [58]:
df.iloc[2,4] = 24
df

     나이 성별    키  체중    BMI
성명
이겨레  25  남  185  89  26.00
조약돌  19  여  163  56  19.95
문도연  23  남  175  70  24.00

In [66]:
# BTS 행 추가
df.loc["BTS"] = 0
df

       나이 성별      키    체중    BMI
성명
이겨레  25.0  남  185.0  89.0  26.00
조약돌  19.0  여  163.0  56.0  19.95
문도연  23.0  남  175.0  70.0  24.00
BTS   0.0  0    0.0   0.0   0.00

In [ ]:
df = df.drop("bts")
# 행 삭제

In [68]:
df.loc["BTS",'나이':'체중'] = 27,"남자",180,75
df

       나이  성별      키    체중    BMI
성명
이겨레  25.0   남  185.0  89.0  26.00
조약돌  19.0   여  163.0  56.0  19.95
문도연  23.0   남  175.0  70.0  24.00
BTS  27.0  남자  180.0  75.0   0.00

In [69]:
df.iloc[3,:3+1] = 28, "남",183,79
df

       나이 성별      키    체중    BMI
성명
이겨레  25.0  남  185.0  89.0  26.00
조약돌  19.0  여  163.0  56.0  19.95
문도연  23.0  남  175.0  70.0  24.00
BTS  28.0  남  183.0  79.0   0.00

In [71]:
# 행과 열의 위치 변경
# df.transpose() -> 기존 객체 변경 (복사본 반환)
# df.T -> 새로운 객체에 할당(복사본 반환)
# p238
print("행과 열의 위치 변경 p238")
print("df.transpose()")
df_TP = df.transpose()
df_TP

행과 열의 위치 변경 p238

성명     이겨레    조약돌    문도연    BTS
나이    25.0   19.0   23.0   28.0
성별       남      여      남      남
키    185.0  163.0  175.0  183.0
체중    89.0   56.0   70.0   79.0
BMI   26.0  19.95   24.0    0.0

In [ ]:
print("행과 열의 위치 변경 p238")
print("df.T")
df_T = df.T
print(df_T)

In [72]:
df

       나이 성별      키    체중    BMI
성명
이겨레  25.0  남  185.0  89.0  26.00
조약돌  19.0  여  163.0  56.0  19.95
문도연  23.0  남  175.0  70.0  24.00
BTS  28.0  남  183.0  79.0   0.00

In [73]:
# 복사본 생성
df1 = df.copy()
df1

       나이 성별      키    체중    BMI
성명
이겨레  25.0  남  185.0  89.0  26.00
조약돌  19.0  여  163.0  56.0  19.95
문도연  23.0  남  175.0  70.0  24.00
BTS  28.0  남  183.0  79.0   0.00

In [77]:
# 행 열 삭제 
df1.drop("BMI", axis=1, inplace=True) #1:열, 0:행
df1

       나이 성별      키    체중
성명
이겨레  25.0  남  185.0  89.0
조약돌  19.0  여  163.0  56.0
BTS  28.0  남  183.0  79.0

In [78]:
df1.drop("조약돌", axis=0, inplace=True)
df1

       나이 성별      키    체중
성명
이겨레  25.0  남  185.0  89.0
BTS  28.0  남  183.0  79.0

In [79]:
df1.drop(["성별","체중"], axis=1, inplace=True)
df1

       나이      키
성명
이겨레  25.0  185.0
BTS  28.0  183.0

In [80]:
df1 = df.copy()
df1

       나이 성별      키    체중    BMI
성명
이겨레  25.0  남  185.0  89.0  26.00
조약돌  19.0  여  163.0  56.0  19.95
문도연  23.0  남  175.0  70.0  24.00
BTS  28.0  남  183.0  79.0   0.00

In [ ]:
# drop은 범위로 삭제 할 수 없다.
df1.drop(["성별":"체중"], axis=1, inplace=True)
df1

In [81]:
df1.drop(["나이","성별"], axis=1, inplace=True)
df1

         키    체중    BMI
성명
이겨레  185.0  89.0  26.00
조약돌  163.0  56.0  19.95
문도연  175.0  70.0  24.00
BTS  183.0  79.0   0.00

In [82]:
df1.drop("조약돌", axis=0, inplace=True)
df1

         키    체중   BMI
성명
이겨레  185.0  89.0  26.0
문도연  175.0  70.0  24.0
BTS  183.0  79.0   0.0